In [1]:
import pandas as pd

In [3]:
Data = pd.read_excel(r'D:\Full Stack Data Science & AI\Notes\August\8 August\Convert row data to clean data.xlsx')

In [5]:
Data

                                        Address       Date Name     Time
0  45 rd, kenith street, btm, bangalore, 500038  14/2/2022  ABC  8:30:21
1    47 rd, texas street, adc, Kolhapur, 569824  13/8/2024  DEF  5:12:38

In [7]:
Data1 = Data['Address']

In [9]:
Data1

0    45 rd, kenith street, btm, bangalore, 500038
1      47 rd, texas street, adc, Kolhapur, 569824
Name: Address, dtype: object

In [11]:
Data2 = Data['Date']

In [13]:
Data2

0    14/2/2022
1    13/8/2024
Name: Date, dtype: object

In [15]:
Data3 = Data['Name']

In [17]:
Data3

0    ABC
1    DEF
Name: Name, dtype: object

In [19]:
Data4 = Data['Time']

In [21]:
Data4

0    8:30:21
1    5:12:38
Name: Time, dtype: object

In [23]:
C_data = Data.copy()

In [25]:
C_data[['Road no', 'Road name', 'City', 'State', 'Zip code']] = Data1.str.split(',', expand=True)

In [27]:
C_data

,Address,Date,Name,Time,Road no,Road name,City,State,Zip code
0,"45 rd, kenith street, btm, bangalore, 500038",14/2/2022,ABC,8:30:21,45 rd,kenith street,btm,bangalore,500038
1,"47 rd, texas street, adc, Kolhapur, 569824",13/8/2024,DEF,5:12:38,47 rd,texas street,adc,Kolhapur,569824

In [29]:
C1 = C_data.drop('Address', axis=1)
C1

        Date Name     Time Road no       Road name  City       State Zip code
0  14/2/2022  ABC  8:30:21   45 rd   kenith street   btm   bangalore   500038
1  13/8/2024  DEF  5:12:38   47 rd    texas street   adc    Kolhapur   569824

In [31]:
C2 = C1.drop('Date', axis=1)
C2

  Name     Time Road no       Road name  City       State Zip code
0  ABC  8:30:21   45 rd   kenith street   btm   bangalore   500038
1  DEF  5:12:38   47 rd    texas street   adc    Kolhapur   569824

In [33]:
C3 = C2.drop('Name', axis=1)
C3

      Time Road no       Road name  City       State Zip code
0  8:30:21   45 rd   kenith street   btm   bangalore   500038
1  5:12:38   47 rd    texas street   adc    Kolhapur   569824

In [35]:
C4 = C3.drop('Time', axis=1)
C4

  Road no       Road name  City       State Zip code
0   45 rd   kenith street   btm   bangalore   500038
1   47 rd    texas street   adc    Kolhapur   569824

In [38]:
C_data = C4.copy()

In [40]:
C_data

  Road no       Road name  City       State Zip code
0   45 rd   kenith street   btm   bangalore   500038
1   47 rd    texas street   adc    Kolhapur   569824

In [42]:
C_data[['Date', 'Month', 'Year']] = Data2.str.split('/', expand=True)

In [44]:
C_data

  Road no       Road name  City       State Zip code Date Month  Year
0   45 rd   kenith street   btm   bangalore   500038   14     2  2022
1   47 rd    texas street   adc    Kolhapur   569824   13     8  2024

In [46]:
C_data['Name'] = Data3

In [48]:
C_data

  Road no       Road name  City       State Zip code Date Month  Year Name
0   45 rd   kenith street   btm   bangalore   500038   14     2  2022  ABC
1   47 rd    texas street   adc    Kolhapur   569824   13     8  2024  DEF

In [50]:
C_data[['Hour', 'Minute', 'Second']] = Data4.str.split(':', expand=True)

In [52]:
C_data

,Road no,Road name,City,State,Zip code,Date,Month,Year,Name,Hour,Minute,Second
0,45 rd,kenith street,btm,bangalore,500038,14,2,2022,ABC,8,30,21
1,47 rd,texas street,adc,Kolhapur,569824,13,8,2024,DEF,5,12,38